Ran Plan for project: `authhub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/authhub-cluster-prod/authhub-web-api-prod"
        name                               = "authhub-web-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for authhub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "authhub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "authhub"
            "Service"     = "authhub-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/authhub-web-api-prod:88" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/authhub-web-api-execution-role-prod"
      + family                   = "authhub-web-api-prod"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for authhub-web-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-web-api"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for authhub-web-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-web-api"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/authhub-web-api-task-role-prod"
      + track_latest             = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
~ task_definition_arn    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/authhub-web-api-prod:88" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-ecs-web-api-prod
  ```
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```